u-blox/ubxlib/port/platform/stm32cube/src/u_port_spi.c
    return shift;
}

// Get the alternate function for an SPI pin.
static int32_t getAf(int32_t spi, int32_t pin, uPortSpiPinType_t pinType)
{
    int32_t af = LL_GPIO_AF_5;

    // From the data sheet for the STM32F437, alternate function
    // is AF5 in all cases except SPI3 which is AF6 unless this
    // is the MOSI pin and it is on PD6
    if ((spi == 3) && (pinType != U_PORT_SPI_PIN_TYPE_MOSI) && (pin != 0x36)) {
        af = LL_GPIO_AF_6;
    }

    return af;
}

// Initialise a GPIO for SPI.
static int32_t initGpio(int32_t spi, int32_t pin, uPortSpiPinType_t pinType)
{
    LL_GPIO_InitTypeDef gpioInitStruct = {0};

    gpioInitStruct.Pin = (1U << U_PORT_STM32F4_GPIO_PIN(pin));
    gpioInitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
    gpioInitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
    gpioInitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    gpioInitStruct.Pull = LL_GPIO_PULL_UP;
    gpioInitStruct.Alternate = getAf(spi, pin, pinType);

    return LL_GPIO_Init(pUPortPrivateGpioGetReg(pin),
                        &gpioInitStruct);
}

// Configure the SPI registers; a much reduced version of HAL_SPI_Init(),
// returning zero on success else negative error code.
static int32_t configureSpi(SPI_TypeDef *pReg,
                            const uCommonSpiControllerDevice_t *pDevice,
                            int32_t pinMosi)
{
    int32_t errorCode = (int32_t) U_ERROR_COMMON_INVALID_PARAMETER;
    int32_t powerOfTwoClockDivisor;

    // Disable the SPI block
    LL_SPI_Disable(pReg);

    // Set master mode
    LL_SPI_SetMode(pReg, LL_SPI_MODE_MASTER);

    // Set the clock frequency: we don't dare change the
    // APB bus frequency, since that may affect many things,
    // we just get as close as we can with the clock divisor
    powerOfTwoClockDivisor = getPowerOfTwoDivisor(getPeripheralClock(pReg),
                                                  pDevice->frequencyHertz);

    // Baud rate control is a 3-bit value where 0 means /2, 1 means /4, etc.
    if ((powerOfTwoClockDivisor > 0) && (powerOfTwoClockDivisor <= 8)) {
        powerOfTwoClockDivisor--;
        LL_SPI_SetBaudRatePrescaler(pReg, powerOfTwoClockDivisor << SPI_CR1_BR_Pos);
        // Set clock polarity and phase
        if ((pDevice->mode & U_COMMON_SPI_MODE_CPOL_BIT_MASK) == U_COMMON_SPI_MODE_CPOL_BIT_MASK) {
            LL_SPI_SetClockPolarity(pReg, LL_SPI_POLARITY_HIGH);
        }
        if ((pDevice->mode & U_COMMON_SPI_MODE_CPHA_BIT_MASK) == U_COMMON_SPI_MODE_CPHA_BIT_MASK) {
            LL_SPI_SetClockPhase(pReg, LL_SPI_PHASE_2EDGE);
        }
        // Set word size
        if (pDevice->wordSizeBytes > 1) {
            LL_SPI_SetDataWidth(pReg, LL_SPI_DATAWIDTH_16BIT);
        }
        // Set bit order
        if (pDevice->lsbFirst) {
            LL_SPI_SetTransferBitOrder(pReg, LL_SPI_LSB_FIRST);
        }
        // Set NSS mode
        if (pDevice->pinSelect >= 0) {
            LL_SPI_SetNSSMode(pReg, LL_SPI_NSS_HARD_OUTPUT);
        }
        // Set RX only mode
        if (pinMosi < 0) {
            LL_SPI_SetTransferDirection(pReg, LL_SPI_SIMPLEX_RX);
        }
        // Note: since the CS/NSS/Select line goes low when SPI
        // is enabled and high when SPI is disabled, we keep
        // SPI disabled here so that it can be toggled during
        // transmission
        errorCode = (int32_t) U_ERROR_COMMON_SUCCESS;
    }

    return errorCode;
}

// Perform an SPI transfer.
// gMutex should be locked before this is called.
static int32_t transfer(int32_t spi, const char *pSend, size_t bytesToSend,
                        char *pReceive, size_t bytesToReceive)
{
    int32_t errorCodeOrReceiveSize = 0;
    SPI_TypeDef *pReg = gpSpiReg[spi];
    size_t transferSize = bytesToSend;
    uint16_t fillWord = gSpiData[spi].fillWord;
    size_t wordSize = 1;

    if (bytesToReceive > transferSize) {
        transferSize = bytesToReceive;
    }

    if (LL_SPI_GetDataWidth(pReg) == LL_SPI_DATAWIDTH_16BIT) {
        wordSize++;
    }

    if (transferSize > 0) {
        // Enable SPI, which will assert CS/NSS/Select
        LL_SPI_Enable(pReg);

        // Do the blocking send/receive
        while (transferSize > 0) {
            if (bytesToSend == 0) {
                // If there's nothing to send, send fill
                // making sure to rotate along the fill
                // word contents if we are sending single
                // bytes
                if ((wordSize > 1) || ((transferSize % 2) == 0)) {
                    pSend = (const char *) &fillWord;
                } else {
                    pSend++;
                }
            }
            if (wordSize > 1) {
                LL_SPI_TransmitData16(pReg, *(uint16_t *) pSend);
            } else {
                LL_SPI_TransmitData8(pReg, *pSend);
            }
            // Wait for the byte to be sent
            while (!LL_SPI_IsActiveFlag_TXE(pReg)) {}
            if (bytesToReceive > 0) {
                // Wait for a byte to be received
                while (!LL_SPI_IsActiveFlag_RXNE(pReg)) {}
                // Read it (which will reset RXNE)
                if (wordSize > 1) {
                    *(uint16_t *) pReceive = LL_SPI_ReceiveData16(pReg);
                } else {
                    *pReceive = LL_SPI_ReceiveData8(pReg);
                }
                bytesToReceive -= wordSize;
                errorCodeOrReceiveSize += wordSize;
                pReceive += wordSize;
            }
            transferSize -= wordSize;
            if (bytesToSend >= wordSize) {
                bytesToSend -= wordSize;
                if (bytesToSend > 0) {
                    pSend += wordSize;
                }
            }
        }

        // Disable SPI, which will switch off CS/NSS/Select
        LL_SPI_Disable(pReg);
    }

    return errorCodeOrReceiveSize;
}

// Get the configuration of the given SPI into pDevice.
// gMutex should be locked before this is called.
static void getDevice(int32_t spi, uCommonSpiControllerDevice_t *pDevice)
{
    SPI_TypeDef *pReg = gpSpiReg[spi];

    memset(pDevice, 0, sizeof(*pDevice));
    pDevice->pinSelect = gSpiData[spi].pinSelect;
    pDevice->frequencyHertz = getPeripheralClock(pReg) >> ((LL_SPI_GetBaudRatePrescaler(
                                                                pReg) >> SPI_CR1_BR_Pos) + 1);
    if (LL_SPI_GetClockPolarity(pReg) == LL_SPI_POLARITY_HIGH) {
        pDevice->mode |= U_COMMON_SPI_MODE_CPOL_BIT_MASK;
    }
    if (LL_SPI_GetClockPhase(pReg) == LL_SPI_PHASE_2EDGE) {
        pDevice->mode |= U_COMMON_SPI_MODE_CPHA_BIT_MASK;
    }
    pDevice->wordSizeBytes = 1;
    if (LL_SPI_GetDataWidth(pReg) == LL_SPI_DATAWIDTH_16BIT) {
        pDevice->wordSizeBytes++;
    }
    if (LL_SPI_GetTransferBitOrder(pReg) == LL_SPI_LSB_FIRST) {
        pDevice->lsbFirst = true;
    }
    pDevice->fillWord = gSpiData[spi].fillWord;
}

